app/controllers/beer_controller.rb

SELECT "beers".* FROM "beers"
SELECT "beers".* FROM "beers" GROUP BY "beers"."category"
---
  def index
    @beer_navbar = true

    @beerList = Beer.all()
    @categoryList = Beer.all().group(:category)

INSERT INTO "beers" ("name", "desc", "abv", "created_at", "updated_at", "brewery", "category") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@beer = Beer.new(beer_params)

    @beer = Beer.new({'name' => 'Spotted Cow', 'brewery' => 'New Glarus Brewing Company', 'desc' => 'Hazy farmhouse ale brewed in New Glarus, WI', 'abv' => '4.80', 'category' => 'ale'})


    @beer.save